       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTPROC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-DATA.
          05 WS-CUST-ID   PIC X(5) VALUE 'C1001'.
          05 WS-CUST-NAME PIC X(20) VALUE 'JOHN DOE'.
       PROCEDURE DIVISION.
           DISPLAY 'PROCESSING CUSTOMER: ' WS-CUST-NAME.
           GOBACK.
